Repository: SeanSpawn/SrcRepair
Catalog: src/srcrepair/AppStrings.*.resx
Languages: ru

# AC_NoItemsSelected
source: No items selected. Please select at least one and then try again!
ru: Вы не выбрали ни один элемент! Очистка невозможна.

# AppAlreadyRunning
source: The program is already running. Starting the second copy is not allowed.
ru: Программа уже выполняется! Запуск нескольких копий не поддерживается.

# AppClipboardCopyError
source: Failed to copy selected data to the clipboard!
ru: Произошла ошибка при попытке скопировать содержимое выбранной ячейки в буфер обмена!

# AppClipboardCutError
source: Failed to cut selected data to the clipboard!
ru: Произошла ошибка при попытке вырезать содержимое выбранной ячейки в буфер обмена!

# AppClipboardPasteError
source: Failed to paste data from the clipboard!
ru: Произошла ошибка при попытке вставить содержимое буфера обмена в выбранную ячейку!

# AppCVListURL
source: https://developer.valvesoftware.com/wiki/Console_Command_List
ru: https://www.easycoding.org/projects/srcrepair/cvarlist

# AppDeleteRowError
source: Failed to delete the selected rows!
ru: Произошла ошибка при попытке удаления выбранных строк!

# AppFailedToGetData
source: Failed to get data from the game database. Please try again later or select another game!
ru: Произошла ошибка при получении данных из базы поддерживаемых игр. Попробуйте ещё раз, либо выберите другую игру!

# AppGenericError
source: Fatal error occurred! The application will be terminated.
ru: Внимание! Произошла критическая ошибка. Работа приложения остановлена.

# AppHelpCHMNotFound
source: The offline help system file is not installed, or is not supported by the selected program language!
ru: Файл оффлайновой справочной системы не установлен, либо не поддерживается для данной языковой версии!

# AppHelpCHMPageError
source: The required page could not be found in the offline help system file!
ru: Не удалось найти запрошенную страницу в файле оффлайновой справочной системы!

# AppImportSettingsError
source: Failed to import settings from the previous version of the application! All settings will be reset to default.
ru: Произошла ошибка во время импортирования настроек из предыдущей версии программы! Параметры будут сброшены на стандартные значения.

# AppIncorrectSrcVersion
source: Incorrect Source Engine version has been detected. This game is not fully supported. Please report this bug to developers!
ru: Обнаружена неподдерживаемая версия движка Source. Пожалуйста, сообщите об этой ошибке разработчикам!

# AppLangPrefix
source: en
ru: ru

# AppLibVersionMissmatch
source: The core library version does not match the application's version. Please reinstall or report this issue to developers.
ru: Обнаружено несоответствие между версиями приложения и основной библиотеки функций! Сообщите об этом разработчикам, либо переустановите программу.

# AppNoDebugFile
source: Debug log file not found!
ru: Файл отладочного журнала не найден!

# AppNoGamesDetected
source: SRC Repair can't detect any installed supported games. Please run the desired game from Steam at least once. After that, it will appear in the list, and you will be able to manage it by this program.
ru: Внимание! Не обнаружено ни одной управляемой игры. Пожалуйста, запустите нужные вам игры из Steam хотя бы один раз. После этого они появятся в списке и вы сможете ими управлять средствами данной программы.

# AppNoGamesDLog
source: No installed games found. Steam located at: {0}.
ru: Не найдено ни одной поддерживаемой игры. Steam расположен в каталоге: {0}.

# AppNoGamesSelected
source: Please select the game first and then try again.
ru: Не выбрано ни одной игры! Пожалуйста выберите в главном окне поддерживаемую игру, а затем повторите вызов функции.

# AppNoSteamIDSetected
source: No Steam user profiles found! Please start Steam at least once and then try again.
ru: Не обнаружено ни одного пользовательского профиля Steam! Запустите его хотя бы один раз, после чего повторите попытку.

# AppRestrSymbLog
source: NonASCII characters detected. Path: {0}.
ru: В пути обнаружены запрещённые символы: {0}.

# AppSafeClnDisabled
source: You have disabled SafeClean module. No backups will be created until you re-activate it.
ru: Внимание! Вы отключили модуль безопасной очистки, поэтому резервные копии создаваться не будут до его повторной активации.

# AppSafeClnStTextOff
source: BackUp: OFF
ru: Копии: выкл

# AppSafeClnStTextOn
source: BackUp: ON
ru: Копии: вкл

# AppSizeBytes
source: B
ru: Б

# AppSizeGigabytes
source: GB
ru: ГБ

# AppSizeKilobytes
source: KB
ru: КБ

# AppSizeMegabytes
source: MB
ru: МБ

# AppStartSteamFailed
source: Unable to start Steam. Please reinstall and try again later.
ru: Не удалось запустить Steam. Проверьте правильность его установки и повторите попытку позднее!

# AppSteamPathEnterInvalid
source: Invalid Steam directory entered by user.
ru: Пользователь ввёл недействительный путь к каталогу установки Steam.

# AppSteamPathEnterWinClosed
source: User closed "Find Steam" window.
ru: Пользователь закрыл диалог указания пути к каталогу установки Steam.

# AppUpdateAvailable
source: A new update for {0} is available. We recommend you to upgrade as soon as possible via Help - Check for updates, or manually.
ru: Внимание! Доступно обновление программы {0}. Рекомендуем вам обновиться как можно скорее через меню Справка - Проверить наличие обновлений, либо вручную.

# AppVideoDbNotFound
source: Cannot get video settings of "{0}" from file "{1}".
ru: Не удалось загрузить графические настройки игры "{0}" из файла "{1}".

# AppVisitWebsiteError
source: Failed to start web browser to visit the official website!
ru: Не удалось запустить веб-браузер для посещения официального сайта программы!

# AppXMLParseError
source: An error occurred while parsing XML game database file. Please reinstall this application.
ru: Произошла ошибка при разборе XML файла со списком игр. Возможно он отсутствует или повреждён. Пожалуйста, переустановите программу.

# BU_BinaryFile
source: The selected file is a binary. Unable open it in a text editor!
ru: Выбранный файл является бинарным, поэтому его невозможно открыть в текстовом редакторе!

# BU_BName_Bud
source: Archive of
ru: Архив от

# BU_BName_Config
source: Game config of
ru: Конфиг игры от

# BU_BName_GameAuto
source: Graph. options autobackup of
ru: Автокопия настроек игры от

# BU_BName_GRGame
source: Graph. settings of
ru: Граф. настройки от

# BU_BName_SRCAll
source: All SRC graph. settings of
ru: Граф. настройки всех игр от

# BU_BName_SteamAll
source: Steam options of
ru: Настройки Steam от

# BU_BName_VChat
source: Muted players
ru: База откл. игроков

# BU_BType_Cfg
source: Config
ru: Конфиг

# BU_BType_Cont
source: Archive
ru: Архив

# BU_BType_DB
source: Database
ru: База данных

# BU_BType_Reg
source: Registry
ru: Реестр

# BU_BType_Unkn
source: Unknown
ru: Неизвестный

# BU_BType_Video
source: Video
ru: Видео

# BU_DelFailed
source: An error occured. File was not removed!
ru: Произошла ошибка при попытке удаления резервных копий. Удаление не было произведено!

# BU_DelMsg
source: Remove selected backup file?
ru: Вы уверены, что хотите удалить выбранные резервные копии?

# BU_DelSuccessful
source: Backup was successfully removed!
ru: Выбранные резервные копии были успешно удалены!

# BU_NoFiles
source: No backup files detected. Please refresh the list and try again later!
ru: Действие невозможно: список резервных копий пуст!

# BU_NoSelected
source: No files selected! Please select at least one and try again.
ru: Действие невозможно: не выбрано ни одного файла!

# BU_OpenTextEditorFailed
source: Failed to load the backup file into the selected text editor!
ru: Не удалось загрузить файл резервной копии в выбранный текстовый редактор!

# BU_QMsg
source: Restore selected backups?
ru: Вы уверены, что хотите восстановить выбранные резервные копии?

# BU_RegCreate
source: Create the registry backup now?
ru: Создать резервную копию сейчас?

# BU_RegDone
source: The registry backup was successfully created!
ru: Файл резервной копии реестра был успешно создан!

# BU_RegErr
source: An error occurred. The backup was not created!
ru: Произошла ошибка при создании резервной копии реестра. Файл не был создан!

# BU_RestFailed
source: An error occurred. The backup was not restored!
ru: Произошла ошибка при попытке восстановить резервную копию. Файл не был восстановлен!

# BU_RestSuccessful
source: The selected backups were successfully restored!
ru: Выбранные резервные копии были успешно восстановлены!

# BU_ShowFileError
source: Failed to show the selected backup file in the file manager!
ru: Произошла ошибка при попытке показать выбранный файл резервной копии в файловом менеджере!

# BU_UnknownType
source: Unknown file type. Can't restore it!
ru: Отсутствуют правила для восстановления такого типа файлов!

# BU_VideoCreate
source: Create a backup of the game video settings now?
ru: Создать резервную копию графических настроек игры?

# BU_VideoDone
source: A backup of the game video settings has been successfully created!
ru: Резервная копия графических настроек игры была успешно создана!

# BU_VideoErr
source: An error occurred while creating a backup copy of the game video settings!
ru: Произошла ошибка при создании резервной копии графических настроек игры!

# CE_BackUpCreated
source: Backup of {0} was successfully created!
ru: Резервная копия файла {0} была успешено создана!

# CE_CfgSVVEx
source: An error occurred. File was not saved!
ru: Внимание! Во время сохранения файла произошла ошибка. Файл не был сохранён!

# CE_ClNoDescr
source: Unfortunately we have no description for this variable. You can help by sending it to us.
ru: К сожалению, для этой переменной у нас нет описания. Вы можете помочь проекту, прислав его нам.

# CE_ClSelErr
source: No variables were found in the selected row!
ru: Переменная в выделенной строке не найдена!

# CE_ExceptionDetected
source: Parsing error were detected. The config was opened with errors. We do not recommend to save it.
ru: Внимание! Во время открытия файла произошла ошибка парсера. Возможно, конфиг открыт не полностью, либо с ошибками.

# CE_NoFileOpened
source: Please open file first in order to use this funtion!
ru: Для использования этой функции откройте файл.

# CE_OpenFailed
source: Could not read the contents of the config file!
ru: Невозможно считать содержимое конфига, т.к. файл не найден!

# CE_RestConfigOpenWarn
source: We not recommend to edit this file, because this may lead to unpredictable consequences. Edit it at your own risk.
ru: Внимание! Настоятельно не рекомендуется редактировать этот файл, т.к. это может привести к непредсказуемым последствиям. Редактируйте его на свой страх и риск.

# CS_FailedToOpenCfg
source: An error occured. Failed to open config selector! Try again later.
ru: Произошла ошибка при вызове модуля выбора конфига для редактирования.

# CS_NEParamsFormException
source: Not enough configs in the list.
ru: Невозможно создать форму, т.к. передано недостаточное количество конфигов.

# FP_BtnInstallText
source: Install selected config
ru: Установить выбранный конфиг

# FP_BtnReplaceText
source: Replace to selected config
ru: Заменить на выбранный конфиг

# FP_BtnUninstallAllText
source: Remove installed config
ru: Удалить имеющийся конфиг

# FP_BtnUninstallSelectedText
source: Remove selected config
ru: Удалить выбранный конфиг

# FP_BtnUpdateText
source: Update selected config
ru: Обновить выбранный конфиг

# FP_DownloadError
source: Cannot find downloaded archive with FPS-config. Please try again later.
ru: Не удалось загрузить архив с файлами FPS-конфига. Попробуйте повторить попытку позднее.

# FP_EditorLoadFailure
source: Failed to load FPS-config to Config Editor!
ru: Произошла ошибка при загрузке FPS-конфига в редактор!

# FP_HashError
source: Failed to check hash sum of the downloaded file. Maybe it was damaged during transfer. Please try again later!
ru: Произошла ошибка при проверке контрольной суммы загруженного архива с FPS-конфигом. Возможно, он был повреждён. Попробуйте ещё раз позднее!

# FP_InstallFailed
source: Could not install the selected config!
ru: Произошла критическая ошибка: невозможно установить выбранный конфиг!

# FP_InstallQuestion
source: Install the selected FPS-config?
ru: Установить выбранный FPS-конфиг?

# FP_InstallSuccessful
source: FPS config has been successfully installed!
ru: Конфиг был успешно установлен!

# FP_NoCfgGame
source: We have no FPS-configs for the selected game. This page will be disabled.
ru: Внимание! Для выбранной игры у нас нет FPS-конфигов, поэтому данная страница будет недоступна!

# FP_NoDescr
source: Unfortunately, the description of the chosen config is not available. We apologize for any inconveniences.
ru: К сожалению, описание выбранного вами конфига недоступно. Приносим извинения за доставленные неудобства.

# FP_RemoveFailed
source: An error occurred during removal of the installed config!
ru: Произошла ошибка при удалении установленного конфига!

# FP_RemoveSuccessful
source: Installed FPS-config has been successfully removed!
ru: Установленный FPS-конфиг был успешно удалён!

# FP_SelectFromList
source: Select the config file from the list above!
ru: Выберите конфиг из списка выше!

# FP_UninstallQuestion
source: Remove the selected FPS-config?
ru: Удалить выбранный FPS-конфиг?

# FrmCloseQuery
source: Close {0}?
ru: Закрыть программу {0}?

# GameNonASCIIDetected
source: Warning! Restricted symbols were detected in the game's installation path. Steam and the games may not work correctly.
ru: Внимание! В пути к выбранной игре обнаружены недопустимые символы. Steam и игра будут работать с ошибками. Переустановите игру в папку, путь до которой будет содержать только латинские буквы.

# GameNonASCIINotDetected
source: The game was installed correctly: directory path does not contain any restricted symbols.
ru: Игра установлена верно: путь к каталогу игры не содержит запрещённых символов.

# GT_DxLevelMsg
source: Enable DirectX 8 mode rendering? It can significantly increase performance, but some games does not support it.
ru: Включить DirectX 8 режим рендера? Это значительно увеличит производительность игры.

# GT_MaxPerfMsg
source: Do you want to set the video settings to the recommended maximum? This will require a powerful computer!
ru: Вы действительно хотите установить настройки графики на рекомендуемый максимум? Для этого потребуется мощный компютер!

# GT_MinPerfMsg
source: Do you want to set the video settings to the recommended minimum? This will increase the game's performance.
ru: Вы действительно хотите установить все настройки видео на минимальные? Это увеличит FPS, но ухудшит графику в игре.

# GT_NCFNReady
source: You need to set all video settings in order to save them into a file.
ru: Для сохранения графических настроек вы должны заполнить все параметры!

# GT_PerfSet
source: Done. Don't forget to adjust and save changes!
ru: Готово. Не забудьте подкорректировать и сохранить изменения в настройках!

# GT_SaveFailure
source: An error occurred while saving video settings!
ru: Произошла ошибка при попытке сохранения графических настроек!

# GT_SaveMsg
source: Save your changes?
ru: Сохранить сделанные вами изменения?

# GT_SaveSuccess
source: Changes ware saved successfully!
ru: Изменения были успешно сохранены!

# GT_VideoLoadErr
source: Could not read video settings of the selected game. Please start it at least once or remove -autoconfig command-line option.
ru: Не удалось загрузить графические настройки выбранной игры. Запустите её как минимум один раз, а также убедитесь, что не используется параметр запуска -autoconfig.

# HD_BtnInstallText
source: Install selected HUD
ru: Установить выбранный HUD

# HD_BtnUpdateText
source: Update selected HUD
ru: Обновить выбранный HUD

# HD_DownloadError
source: Cannot find downloaded HUD archive. Please try again later.
ru: Не удалось загрузить архив с файлами HUD. Попробуйте повторить попытку позднее.

# HD_HashError
source: Failed to check hash sum of the downloaded file. Maybe it was damaged during transfer. Please try again later!
ru: Произошла ошибка при проверке контрольной суммы загруженного архива с HUD. Возможно, он был повреждён. Попробуйте ещё раз позднее!

# HD_InstallError
source: An error occured during HUD installation. Please try again later.
ru: При установке HUD произошла ошибка. Повторите попытку позднее.

# HD_InstallSuccessfull
source: HUD was successfully installed!
ru: Установка HUD была успешно выполнена!

# HD_LastUpdateInfo
source: Last HUD update time: {0}.
ru: Последнее обновление: {0}.

# HD_NotTested
source: The selected HUD is not fully compatible with the latest version of the game.
ru: Внимание! Выбранный вами HUD не полностью совместим с последней версией игры. Рекомендуем выполнить обновление базы HUD из меню Справка.

# HD_Outdated
source: Installation of outdated HUDs is not allowed. Please update database or select another HUD.
ru: Установка устаревших HUD не допускается. Обновите базу поддерживаемых HUD из меню "Справка" - "Проверить наличие обновлений" или выберите другой HUD.

# KB_StartError
source: Failed to start keyboard helper plugin. Try again later!
ru: Не удалось запустить внешний модуль. Попробуйте ещё раз позднее!

# MM_ConvertItemsError
source: An error occurred while converting selected items to a new format!
ru: Произошла ошибка при попытке преобразования выбранных элементов в новый формат!

# MM_ConvRest
source: Conversion from SteamIDv3 to legacy SteamID32 is not allowed!
ru: Преобразование выбранной строки в новый формат записи SteamID не требуется.

# MM_CopyItemsError
source: An error occurred while copying selected items to clipboard!
ru: Произошла ошибка при попытке скопировать выделенные элементы в буфер обмена!

# MM_CutItemsError
source: An error occurred while cutting selected items to clipboard!
ru: Произошла ошибка при попытке вырезать выделенные элементы в буфер обмена!

# MM_ExceptionDetected
source: An error occured while parsing game banlist file. Please try again later.
ru: При загрузке содержимого файла произошла ошибка. Попробуйте ещё раз позже.

# MM_OpenItemProfileError
source: An error occurred while trying to view the selected item's Steam profile in a web browser.
ru: Произошла ошибка при попытке просмотреть профиль Steam выбранного элемента в веб-браузере!

# MM_PasteItemsError
source: An error occurred while trying to paste items from clipboard!
ru: Произошла ошибка при попытке вставить элементы из буфера обмена!

# MM_RefreshError
source: An error occurred while trying to update items from the database!
ru: Прозошла ошибка при попытке обновить элементы из базы данных!

# MM_RemoveItemsError
source: An error occurred while deleting selected items!
ru: Произошла ошибка при попытке удалить выделенные элементы!

# MM_SavedOK
source: Your changes ware saved!
ru: Файл успешно сохранён!

# MM_SaveException
source: An error occured while saving database file! It may be corrupted.
ru: Произошла ошибка при сохранении файла. Возможно, он был повреждён.

# PS_AppRunning
source: {0} application is running! To execute this cleanup please close it first.
ru: Обнаружено запущенное приложение {0}! Чтобы выполнить эту очистку завершите его работу.

# PS_ArchFailed
source: An error occured during packing files. The archive was not created!
ru: Произошла ошибка при упаковке файлов в архив. Архив не был создан!

# PS_BwBusy
source: Cleanup targets are not yet available! Please try again in 10 seconds.
ru: Цели для очистки ещё не были построены! Пожалуйста повторите попытку через 10 секунд.

# PS_CleanPackagesException
source: An error occurred during the package cache removal! Perhaps you have not enough rights for doing this.
ru: Произошла ошибка во время работы процедуры очистки кэша загруженных пакетов! Возможно, у вас отсутствуют необходимые права для этого действия.

# PS_CleanRegistryException
source: An error occurred during the registry entries removal! Perhaps you have not enough rights for doing this.
ru: Произошла ошибка во время удаления записей, хранящихся в реестре! Возможно, у вас отсутствуют необходимые права для этого действия.

# PS_CleanupErr
source: Error occured while deleting files. Some files were not deleted!
ru: Во время удаления файлов произошла ошибка. Некоторые файлы не были удалены!

# PS_CleanupSuccess
source: Cleanup has been successfully completed!
ru: Процесс очистки успешно завершён!

# PS_ClnWndInitError
source: An error occured while trying to open cleanup window. Additional information about this issue has been added to logs.
ru: Произошла ошибка при открытии формы очистки. Дополнительная об инциденте информация добавлена в отладочный журнал.

# PS_ExecuteMSG
source: Perform this cleanup?
ru: Выполнить очистку?

# PS_ProcessDetected
source: Steam process has been successfully terminated!
ru: Процесс Steam, обнаруженный в памяти был успешно завершён!

# PS_SeqCompleted
source: The cleanup has been successfully completed. Steam will run in recovery mode right now!
ru: Очистка успешно выполнена. Steam будет запущен в режиме восстановления прямо сейчас!

# PS_ServiceRepairException
source: An error occurred while trying to run the Steam Service automatic repair procedure! Perhaps you have not enough rights for doing this.
ru: Произошла ошибка при попытке запуска автоматического восстановления Steam Service! Возможно, у вас отсутствуют необходимые права для этого действия.

# PS_ShutdownClientException
source: An error occurred while trying to shut down the running Steam client! Perhaps you have not enough rights for doing this.
ru: Произошла ошибка при попытке завершить работу запущенного клиента Steam! Возможно, у вас отсутствуют необходимые права для этого действия.

# PS_StartClientException
source: An error occurred while trying to start the installed Steam client! Perhaps you have not enough rights for doing this.
ru: Произошла ошибка при попытке запуска установленного клиента Steam! Возможно, у вас отсутствуют необходимые права для этого действия.

# SD_NotEnoughStmIDs
source: Failed to show SteamID selector dialog due to not enough SteamIDs found!
ru: Невозможно отобразить диалоговое окно выбора SteamID, т.к. найдено недостаточное их количество!

# StatusNormal
source: Ready.
ru: Готово.

# StatusOpenedFile
source: Opened file: {0}.
ru: В редакторе открыт файл: {0}.

# SteamNonASCIIDetected
source: Restricted symbols were detected in the Steam installation directory path. Steam and some games can work incorrectly. We recommend to reinstall Steam into a directory, which will contain only latin characters and numbers.
ru: Внимание! В пути к Steam обнаружены недопустимые символы. Steam и игры будут работать с ошибками. Переустановите Steam в папку, путь до которой будет содержать только латинские буквы.

# SteamNonASCIINotDetected
source: No restricted symbols in the Steam installation directory path were detected. No actions needed.
ru: Steam установлен верно: путь к каталогу Steam не содержит запрещённых символов.

# SteamPathCancel
source: You refused to enter the path to Steam, so the program will be terminated!
ru: Вы отказались вводить путь к Steam, поэтому программа будет завершена!

# SteamPathEnterErr
source: You have entered the wrong Steam path! The program will be terminated.
ru: Вы указали неправильный путь! Программа будет завершена.

# UnnamedFileName
source: Unnamed.cfg
ru: Безымянный.cfg
