Repository: SeanSpawn/SrcRepair
Catalog: src/srcrepair/FrmOptions.*.resx
Languages: ru

# MO_Cancel.Text
source: Cancel
ru: Отмена

# MO_UseUpstream.Text
source: Allow download and install latest (untested) HUDs
ru: Разрешить установку новейших версий HUD

# MO_RemEmptyDirs.Text
source: Remove empty directories after safe cleanup
ru: Удалять пустые каталоги после очистки

# MO_ZipCompress.Text
source: Compress files to ZIP before deletion
ru: Создавать бэкап перед запуском очистки

# MO_HighlightOldBackUps.Text
source: Auto-highlight old backup files
ru: Выделять цветом старые резервные копии

# MO_HideUnsupported.Text
source: Hide unsupported by application games
ru: Скрывать не поддерживаемые игры

# MO_ConfirmExit.Text
source: Confirm exit
ru: Подтверждать выход из программы

# MO_TP1.Text
source: Common settings
ru: Общие настройки

# MO_HideOutdatedHUDs.Text
source: Don't show outdated HUDs
ru: Не показывать устаревшие HUD

# MO_AutoCheckUpdates.Text
source: Automatically check for updates
ru: Проверять обновления при запуске

# MO_UnSafeOps.Text
source: Allow unsafe cleanup operations
ru: Разрешить небезопасные методы очистки

# L_MO_CustDirName.Text
source: Custom dir. name:
ru: Имя каст. кат.:

# L_MO_TextEdBin.Text
source: Text editor binary:
ru: Текст. редактор:

# MO_TP2.Text
source: Advanced settings
ru: Расширенные настройки

# MO_SearchBin.Filter
source: Windows binary (*.exe)|*.exe|All files (*.*)|*.*
ru: Приложение Windows (*.exe)|*.exe|Все файлы (*.*)|*.*

# MO_SearchBin.Title
source: Binary selection
ru: Выберите приложение

# $this.Text
source: Options
ru: Настройки {0}
