Repository: SeanSpawn/SrcRepair
Catalog: docs/source/locale/*/LC_MESSAGES/backups.po
Languages: ru

source: BackUps Manager
ru: Управление резервными копиями

source: About backups manager
ru: Об управлении резервными копиями

source: On this page, you can view, remove, or restore backups created by the program.
ru: На этой странице вы можете просматривать, удалять или восстанавливать резервные копии, созданные программой.

source: When safe cleanup is enabled (green light in the status bar), the application automatically creates backup files for the most performed actions.
ru: При включённой опции безопасной очистки (значок в статусной строке светит зелёным), каждое действие программы создаёт резервную копию, которую можно в любой момент восстановить, либо удалить.

source: Working with backup files
ru: Работа с резервными копиями

source: You can select multiple backups by pressing **Ctrl** or **Shift**.
ru: Допускается восстанавливать и удалять сразу несколько копий. Для этого можно их выделять с нажатой клавишей **Ctrl**, либо **Shift**.

source: Plain text backup files can be viewed or edited using a :ref:`text editor <settings-advanced>`. Simply select such a file and click the **Edit in Notepad** button on the main toolbar.
ru: Резервные копии в виде текстовых файлов допускается открыть в :ref:`текстовом редакторе <settings-advanced>` посредством нажатия кнопки **Открыть в текстовом редакторе** на панели инструментов.

source: Binary files with the **bud** extension can be opened by any Zip-archiver.
ru: Бинарные файлы резервных копий с расширением **bud** могут быть загружены в любом архиваторе.

source: Backup types
ru: Типы резервных копий

source: A typical backup file name ``Container_UNIXTIME.bud`` consists of the following parts:
ru: Стандартное имя файла резервной копии ``Container_UNIXTIME.bud`` состоит из следующих частей:

source: **Container** -- prefix;
ru: **Container** -- префикс;

source: **UNIXTIME** -- current datetime in UnixTime format;
ru: **UNIXTIME** -- текущее время на момент создания файла в формате UnixTime;

source: **bud** -- file extension.
ru: **bud** -- расширение файла.

source: BUD files are standard Zip-archives containing files removed by the program, preserving the original directory hierarchy.
ru: BUD-файлы представляют собой стандартные Zip-архивы, состоящие из удалённых программой файлов с сохранением полной иерахии каталогов.

source: Registry backup file names (only on Microsoft Windows platform) are generated as follows:
ru: Имена файлов резервных копий реестра (только на платформе Microsoft Windows) генерируется следующим образом:

source: ``Game_AutoBackUp_UNIXTIME.reg`` -- automatic backup of game video settings;
ru: ``Game_AutoBackUp_UNIXTIME.reg`` -- автоматический бэкап графических настроек игры;

source: ``Game_Options_UNIXTIME.reg`` -- manual backup of game video settings;
ru: ``Game_Options_UNIXTIME.reg`` -- ручной бэкап графических настроек игры;

source: ``Source_Options_UNIXTIME.reg`` -- manual backup of all Source Engine games video settings;
ru: ``Source_Options_UNIXTIME.reg`` -- бэкап графических настроек всех Source-игр, хранящихся в реестре;

source: ``Steam_BackUp_UNIXTIME.reg`` -- manual backup of all Steam settings, stored in the Windows registry.
ru: ``Steam_BackUp_UNIXTIME.reg`` -- бэкап всех настроек Steam, хранящихся в реестре.

source: Backup storage
ru: Хранение резервных копий

source: All backup files are stored in ``%APPDATA%\SRC Repair\backups`` directory, in subdirectories for each game.
ru: Все файлы резервных копий хранятся в каталоге ``%APPDATA%\SRC Repair\backups``, в подкаталоге по короткому названию игры.

source: The number of backups is not limited, so don't forget to remove them manually. No automatic removal will be performed.
ru: Максимальное количество резервных копий не ограничено и зависит только от наличия свободного места на диске, с которого запускается программа. Автоматическое удаление не производится.

source: Old backup files (older than 30 days) will be highlighted in the list for your convenience (this can be disabled in :ref:`settings <settings-main>`).
ru: Старые резервные копии, созданные более 30 дней назад, подсвечиваются в списке для удобства их визуального поиска и последующего удаления (может быть отключено в :ref:`настройках программы <settings-main>`).

source: Backup restoration
ru: Восстановление резервных копий

source: If you want to restore a backup, just select the file (or files) from the list and click the **Restore selected backup** button on the main toolbar.
ru: Чтобы восстановить резервную копию, просто выберите нужную строку (или строки) из списка и нажмите на панели инструментов программы кнопку **Восстановить выбранную резервную копию**.

source: Confirm restoration.
ru: Подтвердите восстановление.

source: Backup removal
ru: Удаление резервных копий

source: If you want to remove a backup, just select the file (or files) from the list and click the **Remove selected backup** button on the main toolbar.
ru: Чтобы удалить резервную копию, просто выберите ненужную более строку (или строки) из списка и нажмите на панели инструментов программы кнопку **Удалить выбранную резервную копию**.

source: Confirm deletion. Removed files cannot be restored!
ru: Подтвердите удаление. Удалённые файлы невозможно восстановить!

source: Creating registry backups
ru: Создание резервных копий реестра

source: If you want to create a backup of video settings, video settings of all Source Engine games or Steam settings, stored in the Windows registry, click the **Create** button on the main toolbar and select an option from the drop-down menu. The backup file will be created and added to the list.
ru: Чтобы создать резервную копию графических настроек выбранной игры, всех Source игр или всего Steam, нажмите кнопку **Создать** на панели инструментов и в выпадающем меню выберите резервную копию чего мы создаём. Бэкап будет создан и автоматически добавлен в список резервных копий.
