Repository: SeanSpawn/SrcRepair
Catalog: docs/source/locale/*/LC_MESSAGES/cleanup.po
Languages: ru

source: Troubleshooting and cleanup
ru: Устранение проблем и очистка

source: About cleanup manager
ru: О менеджере очистки

source: On this page you can resolve most known Steam and Source Engine games issues. You can also clean up the garbage that has accumulated in the game due to regular daily use.
ru: Инструменты, представленные на этой странице, позволяют решать большинство известных проблем, с которыми сталкиваются пользователи Steam и Source-игр, а также очищать выбранную игру от различного мусора, который накапливается при её ежедневном использовании.

source: Troubleshooting and recovery
ru: Устранение проблем и восстановление

source: To begin recovery, select at least one option from the **Steam troubleshooting** group and click the **Cleanup Now!** button.
ru: Чтобы начать восстановление, выберите хотя бы одну из доступных опций из раздела **Устранение проблем Steam**, а затем нажмите кнопку **Выполнить!**.

source: Warning! The Steam client will be automatically terminated (if it is running).
ru: Внимание! Все процессы Steam будут автоматически завершены (если он был запущен).

source: Known issues that can be resolved with this tool:
ru: Известные проблемы, исправляемые данным модулем:

source: login errors;
ru: ошибки входа;

source: errors like **Steam servers are not available**, **This game is not available at this time**, **No Steam connection**, **Could not connect to Steam network**, etc.;
ru: ошибки типа **Серверы Steam перегружены**, **Эта игра недоступна в настоящее время**, **Ошибка подключения к серверам Steam**;

source: endless connection to servers;
ru: ошибки бесконечного подключения к серверам (Steam делает вид, что подключается, но ничего не происходит);

source: some issues, related to Friends system;
ru: ошибки, связанные со списком друзей (например, после выхода из игры статус остаётся **В игре** и не меняется длительное время и т.д.);

source: damaged installation (after running this, Steam client will be re-downloaded from the official servers);
ru: повреждённые файлы установки, например, после неправильного выхода из клиента Steam за счёт их принудительного обновления с официальных серверов;

source: some other issues.
ru: множество других ошибок.

source: Principle of operation
ru: Принцип работы инструмента восстановления

source: If the **Clean downloaded Steam package cache** is checked, SRC Repair will get the Steam installation path, find and remove all downloaded package cache files, and force Steam recovery the next time you launch it. Once removed, these files will be redownloaded and the client will be reinstalled automatically, which should resolve many issues with broken or missing files.
ru: При выборе пункта **Очистить кэш загруженных пакетов Steam**, программа определяет путь установки Steam и удаляет кэш загруженных пакетов, а также прописывает следующий запуск Steam в режиме восстановления. После удаления, данные файлы будут автоматически загружены заново с сервера, а клиент будет переустановлен автоматически, что должно решить множество проблем с повреждёнными или отсутствующими файлами.

source: If the **Clean all Steam registry entries** is checked, SRC Repair will remove the ``HKEY_CURRENT_USER\Software\Valve\Steam`` registry key, and force Steam recovery the next time you launch it. If safe clean is enabled (green light in the status bar), a backup file will be created automatically.
ru: При выборе пункта **Очистить записи Steam, хранящиеся в реестре**, программа удаляет содержимое ключа реестра ``HKEY_CURRENT_USER\Software\Valve\Steam``, а также заставляет Steam в следующий раз запуститься в режиме восстановления. Если включена опция безопасной очистки (горит зелёный индикатор в строке состояния), будет создан файл резервной копии.

source: If the **Run Steam service automatic repair** is checked, SRC Repair will run built-in Steam service automatic recovery function.
ru: При выборе пункта **Запустить авто-восстановление Steam service**, программа запустит встроенную функцию автоматического восстановления Steam service.

source: Installation path checker
ru: Служба обнаружения некорректного пути

source: This tool will automatically check for restricted (non-ASCII) symbols in the Steam installation path. The Steam path should contain only latin letters and numbers. Anything else can cause major issues with games compiled without Unicode support.
ru: Проверяет путь Steam на наличие в нём запрещённых символов: русских, немецких, французских и т.д. букв, а также прочих символов юникода. Данные символы создают проблемы при запуске некоторых игр, не поддерживающих юникод.

source: If any restricted symbols were found, a warning message will be shown. Also you will see a red sign in the **General information** section.
ru: Если запрещённые символы будут найдены, то будет выдано сообщение об этом, а также вы увидите красный значок в группе **Информация о текущей установке Steam**.

source: This tool runs automatically along with SRC Repair and cannot be disabled.
ru: Данная служба запускается автоматически при каждом запуске SRC Repair и не может быть отключена.

source: Game cleanup wizard
ru: Служба очистки игр и удаления ненужных данных

source: This tool allows you to clean up the garbage that has accumulated in the game through regular daily use. This can free up a lot of disk space.
ru: Позволяет пользователю быстро и безболезненно удалить ненужные и/или устаревшие данные и кэши, которые способны занимать на жёстком диске несколько сотен мегабайт свободного места.

source: After selecting the cleanup action, the :ref:`safe clean window <modules-cleanup>` will appear. You can manually check the list of files marked for deletion.
ru: После выбора варианта очистки программа произведёт поиск ненужных данных и выдаст :ref:`отдельное окно модуля очистки <modules-cleanup>`, в котором вы сможете просмотреть список файлов, помеченных для удаления.

source: If you don't want to remove a file, uncheck the checkbox next to its name. All marked files will be removed.
ru: Если около имени файла стоит флажок, значит он будет удалён при запуске очистки. Чтобы оставить файл, просто уберите флажок около него.

source: When done, click the **Execute cleanup** button to run the cleanup sequence. If you change your mind, click **Cancel**.
ru: Для запуска очистки нажмите кнопку **Выполнить очистку**, а для выхода без очистки -- **Отмена**.

source: Currently supported by SRC Repair cleanup actions:
ru: В настоящее время SRC Repair способен выполнять следующие варианты очистки:

source: **custom maps** -- remove downloaded or installed custom maps. This will free up a lot of disk space and can speed up the game startup;
ru: **кастомные карты** -- удаляет нестандартные карты, скачанные с серверов. Это позволит ускорить запуск игры (Source-игра при своём запуске их считывает чтобы добавить в список доступных карт) и освободить много места на жёстком диске (от нескольких сотен мегабайт до нескольких гигабайт);

source: **download cache** -- remove downloaded from game servers data: personal sprays of all the players you have ever seen on the servers, various partially downloaded or damaged during download files, etc. Contains garbage. We recommend to run this cleanup at least once a week;
ru: **кэш загрузок** -- содержит данные, когда-либо скачанные с игровых серверов, спреи всех игроков, когда-либо игравших вместе с вами на игровом сервере, а также недокачанные и повреждённые во время скачивания файлы. Способен занимать сотни мегабайт. Содержит абсолютно ненужные данные. Рекомендуется очищать несколько раз в месяц;

source: **custom directory** -- remove installed custom modifications from the ``/custom`` directory (only if supported by the game);
ru: **кастомный каталог** -- удаляет все установленные нестандартные модификации игры, расположенные в ``/custom`` (если поддерживается выбранной игрой);

source: **custom sounds** -- remove sound files downloaded from game servers;
ru: **кастомные звуки** -- очищает загруженные с серверов и установленные пользователем нестандартные звуковые файлы;

source: **FPS-configs** -- remove installed :ref:`FPS-configs <fps-about>`;
ru: **FPS-конфиги** -- позволяет удалить все установленные :ref:`FPS-конфиги <fps-about>`;

source: **graph and sound cache** -- remove sound and graphic caches created by the game. It can fix some issues. They will be automatically created the next time you start the game;
ru: **звуковой кэш** -- удаляет звуковой кэш, созданный игрой. Используйте в случаях его повреждения, либо для оптимизации. Кэш будет создан заново при следующем запуске игры;

source: **secondary cache** -- remove downloaded from game servers cache files. We recommend to run this cleanup at least once a month;
ru: **вторичный кэш** -- содержит данные, скачанные с игровых серверов. Рекомендуется очищать несколько раз в месяц;

source: **screenshots** -- remove screenshots from the ``/screenshots`` directory. Can free up a lot of disk space;
ru: **скриншоты** -- удаляет скриншоты из подкаталога ``/screenshots``. Удаление скриншотов способно освободить от нескольких сотен мегабайт до десятка гигабайт места на диске;

source: **recorded demos** -- remove recorded, downloaded or installed demo files (files \*.dem) from the game directory;
ru: **записанные демки** -- удаляет все записанные или установленные демки (файлы \*.dem), находящиеся в каталоге игры. Это способно освободить от нескольких десятков до нескольких сотен мегабайт места на диске;

source: **models and textures** -- remove models and textures downloaded from game servers or installed by different custom modifications;
ru: **модели и текстуры** -- позволяет удалить нестандартные текстуры и модели, установленные пользователем, либо скачанные с игровых серверов;

source: **deep cleanup** -- try to remove all garbage from the game at once. You **must** run the game :ref:`cache verification <cleanup-advanced>` after running this cleanup;
ru: **глубокая очистка** -- запускает удаление всего возможного мусора, а также старых бинарников, кэшей и конфигов. По окончании **необходимо** запустить :ref:`проверку целостности кэша <cleanup-advanced>`;

source: **replays** -- remove files created by the Replay system (only if supported by the game).
ru: **реплеи (повторы)** -- удаляет файлы и кэши, созданные системой Replay.

source: Deep cleanup
ru: Служба специальной очистки

source: **Clean game settings (+video)** -- reset all in-game video settings. A backup file will be created.
ru: **Очистить все настройки игры** -- позволяет полностью удалить графические и прочие настройки управляемой игры. Перед удалением будет создана резервная копия.

source: **Remove all binaries and launchers** -- remove the game binaries and launchers (contents of the ``/bin``, ``/{game}/bin`` directories and the ``/hl2.exe`` file). Use this if you have issues with starting the game, crashes of different origin, etc. You **must** validate the game cache after running this cleanup.
ru: **Очистить старые бинарники и лаунчеры** -- полностью удаляет двоичные файлы, которые используются для запуска программы (содержимое каталогов ``/bin``, ``/{game}/bin`` и файл ``/hl2.exe``). Используйте данный вариант очистки если игра не запускается, либо вылетает сразу после запуска с ошибкой. После окончания очистки обязательно запустите проверку целостности кэша.

source: **Validate game cache files** -- force the game cache verification. This will check all the game data and re-download any corrupted or missing files. You must run this process after running the deep cleanup or removing the game binaries and launchers.
ru: **Проверить целостность игрового кэша** -- запускает проверку файлов игры на наличие повреждений, а также докачивает отсутствующие. Рекомендуется запускать после выполнения глубокой очистки, а также удаления старых бинарников и лаунчеров.
