Repository: SeanSpawn/SrcRepair
Catalog: docs/source/locale/*/LC_MESSAGES/fps-configs.po
Languages: ru

source: FPS-config manager
ru: Управление FPS-конфигами

source: About FPS configs
ru: О FPS-конфигах

source: On this page you can install, remove or update one of the available and tested FPS-configs into the selected game.
ru: На этой странице вы можете быстро установить, удалить или обновить один из доступных и протестированных FPS-конфигов в выбранную игру.

source: FPS-config is a text file named ``autoexec.cfg``. It can significantly improve game performance by changing hidden advanced video settings.
ru: FPS-конфиг (файл конфигурации) представляет собой текстовый файл с именем ``autoexec.cfg``, который способен значительно увеличить производительность игры со значительной потерей качества выдаваемой картинки посредством изменения скрытых настроек графики.

source: Settings obtained from FPS-config have higher priority than those set by the :ref:`Graphic tweaker <graphic-tweaker>` or by the game itself.
ru: Настройки, полученные из установленного FPS-конфига имеют более высокий приоритет, чем те, что заданы на вкладке :ref:`Графические настройки <graphic-tweaker>`, либо внутри самой игры.

source: Select a config from the list to read its description.
ru: Выберите конфиг из списка, чтобы прочитать его краткое описание.

source: Installed FPS-configs can be edited using the :ref:`Config editor <editor-working>`.
ru: Установленные FPS-конфиги могут быть загружены в :ref:`Редактор конфигов <editor-working>`.

source: All FPS-configs are being downloaded from the cloud and licensed "as is".
ru: Все FPS-конфиги загружаются из облака и распространяются по лицензии "как есть".

source: Supported FPS-configs
ru: Поддерживаемые FPS-конфиги

source: The following FPS-configs are supported by current version of the application:
ru: Следующие FPS-конфиги поддерживаются в текущей версии программы:

source: chrismaxquality (reverse);
ru: chrismaxquality (обратный);

source: comangliacinema (reverse);
ru: comangliacinema (обратный);

source: mastercomfig-quality (reverse);
ru: mastercomfig-quality (обратный);

source: FPS-config installation
ru: Установка FPS-конфига

source: To install a FPS-config, select it from the list of available configs, press the **Install selected config** button and confirm this operation.
ru: Чтобы установить конфиг, выберите его из списка, а затем нажмите кнопку **Установить выбранный конфиг** и подтвердите намерение.

source: All required files will be downloaded and installed automatically.
ru: Все необходимые для работы файлы будут загружены и установлены автоматически.

source: If safe clean is enabled (green light in the status bar) and you already have ``autoexec.cfg`` file installed, the backup will be created automatically. You can restore or delete it on :ref:`BackUps <backups-about>` tab.
ru: Если включена опция безопасной очистки (в статусной строке программы горит зелёный индикатор), то при наличии уже существующего файла ``autoexec.cfg``, будет автоматически создана его резервная копия, которую вы сможете восстановить в любое время на странице :ref:`Резервные копии <backups-about>`.

source: Some configs are not supported by games. In this case, you will see a warning message.
ru: Внимание! Далеко не все конфиги поддерживаются управляемой игрой. Если вы выбрали неподдерживаемый конфиг, будет выведено соответствующее сообщение.

source: Do not install more than one FPS-config, as this may lead to unpredictable consequences.
ru: Не устанавливайте более одного FPS-конфига в игру, т.к. это может привести к непредсказуемым последствиям.

source: FPS-config uninstallation
ru: Удаление FPS-конфига

source: To remove a FPS-config, select it from the list of available configs, press the **Remove selected config** (or the **Remove installed config**) button and confirm this operation.
ru: Чтобы удалить установленный конфиг, выберите его из списка и нажмите кнопку **Удалить установленный конфиг** (или **Удалить имеющийся конфиг**), после чего подтвердите намерение.

source: If safe clean is enabled (green light in the status bar), the backup will be created automatically. You can restore or delete it on :ref:`BackUps <backups-about>` tab.
ru: Если включена опция безопасной очистки (в статусной строке программы горит зелёный индикатор), то будет автоматически создана резервная копия, которую вы сможете восстановить в любое время на странице :ref:`Резервные копии <backups-about>`.

source: Known issues with FPS-configs
ru: Возможные проблемы с FPS-конфигами

source: After installing FPS-configs voice chat can stop working, sprays and face animation can be disabled. This is conceived. Most of FPS-configs disable this functions in order to significantly increase game performance.
ru: После установки FPS-конфига у вас могут перестать отображаться спреи в игре, прекратить работу лицевая анимация, либо вы перестанете слышать речь других людей в голосовом чате. Это нормально, т.к. большинство FPS-конфигов отключают данные функции в угоду значительного повышения производительности.

source: If you want to enable them again, you will need to :ref:`remove all installed FPS-configs <fps-uninstall>` and then change the following variables via the ``autoexec.cfg`` file or by using the developer console:
ru: Если вы снова хотите включить данные функции, полностью :ref:`удалите FPS-конфиги <fps-uninstall>`, а затем пропишите в консоли разработчика игры или в файле **autoexec.cfg** следующие строки:

source: If you are using the developer console (can be accessed by pressing the **~** (tilde) button), remember to press **Enter** after entering each line.
ru: Если вы прописываете строки в консоли разработчика (вызывается клавишей **~** (тильда)), не забывайте после ввода каждой нажимать **Enter** на клавиатуре.

source: Reverse FPS-configs
ru: FPS-конфиги наоборот

source: If you want to set all video settings to maximum to get the best quality, you can install specical :ref:`reverse FPS-configs <fps-available>`.
ru: Если вы хотите установить все настройки игры на максимум, установите один из специальных :ref:`FPS-конфигов <fps-available>`, отмеченных словом **обратный**.

source: You will need a high-end computer in order to use them.
ru: Это обеспечит наилучшее качество графики, но потребуется производительный компьютер.
