Repository: SeanSpawn/SrcRepair
Catalog: docs/source/locale/*/LC_MESSAGES/getting-started.po
Languages: ru

source: Getting started
ru: Приступая к работе

source: Starting program
ru: Запуск программы

source: You can launch SRC Repair from the Start menu right after installation: **Start** -- **SRC Repair** -- **SRC Repair**.
ru: Запустить программу можно сразу после установки через меню **Пуск** -- **Программы** -- **SRC Repair** -- **SRC Repair**.

source: Localization selection
ru: Выбор локализации

source: SRC Repair will automatically detect and use the default OS language if supported by the application.
ru: SRC Repair автоматически выбирает язык в зависимости от региональных настроек операционной системы, если он поддерживается приложением.

source: Admin permissions
ru: Работа с повышенными правами

source: SRC Repair can be started with or without administrator rights.
ru: SRC Repair может быть запущена как с правами локального администратора, так и без них.

source: We recommend running this program **without** administrator rights, however some advanced features will not be available:
ru: Мы рекомендуем запускать эту программу **без** прав администратора, хотя следующие функции будут при этом недоступны:

source: :ref:`System buttons disabler <modules-kbd>`;
ru: :ref:`Модуль отключения системных клавиш <modules-kbd>`;

source: When you use them, SRC Repair will display the standard Windows UAC dialog and run only that module as an administrator for maximum security.
ru: Когда вы воспользуетесь ими, SRC Repair отобразит стандартное окно Windows UAC и запустит только этот модуль с правами администратора для максимальной безопасности.

source: You can also run the application as an administrator. Right-click on the SRC Repair shortcut in the Start menu or on desktop, select **Run with administrator** and confirm this action.
ru: Вы также можете запустить приложение с правами администратора. Для этого нажмите правой кнопкой мыши по ярлыку SRC Repair в меню Пуск, либо на рабочем столе и из контекстного меню выберите пункт **Запуск от имени администратора**, затем подтвердите своё намерение.

source: After completing the necessary actions, please return to standard user rights. Staying as a super-user is not completely safe.
ru: После выполнения необходимых действий, настоятельно рекомендуется сразу завершить работу программы и вернуться в обычный режим, т.к. постоянная работа в режиме администратора небезопасна.

source: Startup actions
ru: Действия, выполняемые при запуске

source: The following actions will be performed on SRC Repair's startup:
ru: Следующие действия выполняются автоматически при запуске SRC Repair:

source: getting Steam installation directory path;
ru: получение полного пути к каталогу установки Steam;

source: checking if Steam installation directory exists;
ru: проверка существования каталога установки Steam;

source: checking if required Steam configuration files exists and can be read;
ru: проверка на существование необходимых файлов конфигурации Steam и возможности их чтения;

source: getting the list of supported games;
ru: получение списка поддерживаемых игр;

source: checking for installed supported games;
ru: поиск установленных игр;

source: creating user-friendly GUI;
ru: создание графического интерфейса пользователя;

source: working with updates, if enabled in :ref:`advanced settings <settings-advanced>`.
ru: работа с обновлениями, если это разрешено в :ref:`расширенных настройках <settings-advanced>`.

source: If the program cannot find Steam installation directory path in the Windows Registry (only on Microsoft Windows platform) or in known common locations (all other supported platforms), the **Find Steam directory** dialog will appear (but only once).
ru: Если при проверке не удастся получить путь к каталогу установки Steam из реестра Windows (только на платформе Microsoft Windows), либо найти его при помощи списка известных каталогов (на всех остальных поддерживаемых платформах), будет выдано окно с предложением указать его на диске вручную. Путь, заданный вручную, сохранится в файле конфигурации и повторно запрашиваться не будет.

source: Using application
ru: Начало работы с программой

source: First you will need to select a game from the list of supported and installed Source Engine games. Your choise will be saved.
ru: Для начала работы выберите из списка одну из поддерживаемых игр. Ваш выбор сохранится в настройках программы.

source: If only one game is found, it will be selected automatically.
ru: Если на вашем компьютере обнаружена только одна установленная игра, она будет выбрана автоматически.

source: If the program cannot find the required game, please launch it at least once from Steam and then restart SRC Repair.
ru: Если программа не находит какую-либо из поддерживаемых игр, то просто хотя бы раз запустите её из Steam. После выхода из неё и повторного запуска SRC Repair, она появится в списке.

source: Data files storage
ru: Хранение файлов программы

source: All program settings are stored in the ``%LOCALAPPDATA%\EasyCoding_Team`` directory (each subdirectory for every version).
ru: Настройки SRC Repair хранятся в каталоге ``%LOCALAPPDATA%\EasyCoding_Team``, для каждой версии отдельно.

source: Created by program :ref:`backups <backups-about>` can be found in the ``%APPDATA%\SRC Repair\backups`` directory.
ru: Созданные программой :ref:`резервные копии <backups-about>` хранятся в каталоге ``%APPDATA%\SRC Repair\backups``.

source: All other data files -- ``%APPDATA%\SRC Repair``.
ru: Все остальные файлы -- ``%APPDATA%\SRC Repair``.

source: Logs -- ``%APPDATA%\SRC Repair\logs``.
ru: Журналы работы -- ``%APPDATA%\SRC Repair\logs``.

source: Updating application
ru: Обновление программы

source: You can :ref:`check for updates <modules-updater>` from the **Help** -- **Check for updates** menu.
ru: Вы можете запустить :ref:`проверку наличия обновлений <modules-updater>` программы через меню **Справка** -- **Проверить наличие обновлений**.

source: SRC Repair will automatically check for new versions once a week (can be disabled in :ref:`advanced settings <settings-advanced>`).
ru: SRC Repair будет автоматически проверять наличие новых версий один раз в неделю (может быть отключено в :ref:`расширенных настройках <settings-advanced>`).

source: Uninstalling program
ru: Удаление программы

source: If you want to uninstall SRC Repair from your compuler, use **Start** -- **Settings** -- **Apps** -- **Apps & features** -- **SRC Repair** -- **Uninstall**.
ru: Чтобы удалить SRC Repair, запустите встроенную программу удаления через **Пуск** -- **Параметры** -- **Приложения** -- **Приложения и возможности** -- **SRC Repair** -- **Удалить**.

source: Uninstaller will automatically remove all program files, shortcuts, registry entries, but will save created by user :ref:`data files <gs-datafiles>`. You can remove them manually.
ru: Программа автоматического удаления сотрёт все файлы программы, записи реестра, ярлыки, но сохранит настройки и резервные копии на случай если вы решите когда-нибудь переустановить SRC Repair. Эти :ref:`файлы <gs-datafiles>` вы можете удалить вручную.
