Repository: SeanSpawn/SrcRepair
Catalog: docs/source/locale/*/LC_MESSAGES/graphic-tweaker.po
Languages: ru

source: Graphic tweaker
ru: Редактор графических настроек

source: About graphic tweaker
ru: О редакторе графических настроек

source: On this page you can view or edit graphic settings of all supported games without launching them.
ru: Инструменты вкладки **Графические настройки** позволяют легко и быстро редактировать все основные настройки управляемой игры без необходимости её запуска.

source: Graphic settings of Type 1 games
ru: Настройки графики игр первого типа

source: Available settings:
ru: Доступные опции:

source: **horisontal resolution** -- an integer ranging from *640* to *2000* pixels;
ru: **разрешение по горизонтали** -- целое число в диапазоне от *640* до *2000* пикселей;

source: **vertical resolution** -- an integer ranging from *480* to *1900* pixels;
ru: **разрешение по вертикали** -- целое число в диапазоне от *480* до *1900* пикселей;

source: **display mode**: *fullscreen* or *windoweed*. In most cases, it is recommended to use fullscreen mode for maximum performance;
ru: **режим запуска**: *полноэкранный* или *оконный*. В большинстве случаев рекомендуется полноэкранный режим, т.к. он работает наиболее стабильно на большинстве компьютеров и обеспечивает максимальную производительность;

source: **model quality**: *low*, *medium* or *high*. At the maximum value, the most powerful GPU will be required;
ru: **детализация моделей**: *низкая*, *средняя* или *высокая*. Чем выше значение, тем более мощная видеокарта потребуется для игры;

source: **texture quality**: *low*, *medium* or *high* (the same as models);
ru: **детализация текстур**: *низкая*, *средняя* или *высокая* (аналогично детализации моделей);

source: **shaders quality**: *low* or *high* -- set the quality of shader effects;
ru: **шейдеры**: *низк.* или *высок.* -- управляет качеством эффектов, реализуемых с помощью шейдеров;

source: **water reflections**: *simple* (no water reflections at all), *reflect world* (balanced between quality and performance) or *reflect all* (maximum quality, all reflections will be enabled; requires a high-end CPU and GPU);
ru: **отражения в воде**: *простые* (в воде не отображается ничего), *отображать мир* (баланс между качеством картинки и производительностью) или *отображать всё* (максимальное качество отражений, требуются мощная видеокарта и процессор);

source: **shadow quality**: *low* or *high* -- set shadow quality. The shadows can be disabled completely only by installing the :ref:`FPS-config <fps-install>`;
ru: **прорисовка теней**: *низкая* или *высокая* -- управляет качеством динамических теней. Отключить тени полностью можно только с помощью установки :ref:`FPS-конфига <fps-install>`;

source: **color correction**: *enabled* or *disabled* -- set color and gamma correction;
ru: **коррекция цвета**: *включена* или *выключена* -- отвечает за программную коррекцию цветовой гаммы;

source: **antialiasing mode**: *disabled*, *2x*, *4x*, *8x* or *16x* -- set the anti-aliasing quality level (FSAA) and its algorithm: hardware (only GPU will be used) or software (both GPU and CPU; maximum quality with huge resource consumption);
ru: **сглаживание**: *отключено*, *2x*, *4x*, *8x* или *16x* -- задаёт параметры полноэкранного сглаживания (Anti-Aliasing (FSAA)) и алгоритм сглаживания: аппаратный (задействуются ресурсы только видеокарты) или программный (задействуется и видеокарта, и процессор; достигается наилучший результат, но расходуется слишком много ресурсов);

source: **filtering mode**: *bilinear*, *trilinear* or *anisotropic* \*x (2x, 4x, 8x, 16x) -- set texture filtering level. The higher the level, the more powerful GPU will be required. The optimal balance of performance and quality can be achieved using anisotropic levels of 4x or 8x. Trilinear filtration is faster then bilinear or anisotropic;
ru: **фильтрация**: *билинейная*, *трилинейная* или *анизотропная* \*x (2x, 4x, 8x, 16x) -- задаёт параметры фильтрации текстур. Чем выше значение, тем более мощная видеокарта потребуется. Наилучшее соотношение производительность/качество достигается при анизотропной фильтрации 4x или 8x. Трилинейная фильтрация на большинстве видеокарт работает быстрее билинейной и анизотропной;

source: **vertical synchronization**: *disabled* or *enabled* -- control vertical synchronization (frame limiter). If enabled, the frame rate will be limited by your monitor's refresh rate and will prevent screen tearing;
ru: **вертикальная синхронизация**: *выключена* или *включена* -- управляет вертикальной синхронизацией (ограничителем кадров). При включении, видеокарта будет выдавать ровно столько кадров, сколько способен выдать монитор, что приведёт к подавлению эффекта разрыва изображения (тиринга);

source: **motion blur**: *disabled* or *enabled* -- enable or disable motion blur post-effect;
ru: **размытие движения**: *выключено* или *включено* -- включает или выключает пост-эффект Motion Blur (размытие движущихся объектов);

source: **DirectX mode**: *8.0*, *8.1*, *9.0*, *9.0c* -- set DirectX feature level. 8.x will disable some effects and significantly increase performance. :ref:`Some games <faq-gm-dx8>` supports only 9.0c;
ru: **режим DirectX**: *8.0*, *8.1*, *9.0*, *9.0c* -- позволяет выбрать нужный режим DirectX. На слабых компьютерах рекомендуется выбирать 8.0 или 8.1 для того, чтобы увеличить производительность, а на современных 9.0c для достижения максимального качества картинки. :ref:`Некоторые игры <faq-gm-dx8>` поддерживают только 9.0c;

source: **High Dynamic Range**: *disabled* or *enabled* -- allow or disallow High Dynamic Range effects.
ru: **HDR**: *выключены* или *включены* -- позволяет включить или выключить эффекты High Dynamic Range.

source: Graphic settings of Type 2 games
ru: Настройки графики игр второго типа

source: **aspect ratio** -- *normal (4:3)*, *widescreen (16:9)* or *widescreen (16:10)*;
ru: **формат экрана** -- *обычный (4:3)*, *широкоэкранный (16:9)* или *широкоэкранный (16:10)*;

source: **brightness** -- set in-game brightness level;
ru: **яркость** -- задаёт яркость внутри самой игры;

source: **display mode** -- *fullscreen*, *windoweed*, *windoweed (no border)*;
ru: **режим отображения**: *полноэкранный*, *оконный* или *оконный (без рамки)*;

source: **wait for vertical sync**: *disabled*, *enabled (double buffered)* or *enabled (triple buffered)* -- control vertical synchronization (frame limiter). If enabled, the frame rate will be limited by your monitor's refresh rate and will prevent screen tearing;
ru: **вертикальная синхронизация**: *выключена* или *включена* -- управляет вертикальной синхронизацией (ограничителем кадров). При включении, видеокарта будет выдавать ровно столько кадров, сколько способен выдать монитор, что приведёт к подавлению эффекта разрыва изображения (тиринга);

source: **multicore rendeding** -- *disabled* or *enabled*. Allow all physical cores to be used in multi-core processors. May cause crashes, but significantly increases frame rate;
ru: **многоядерный рендеринг** -- *выключено* или *включено*. Позволяет задействовать для рендеринга все ядра многоядерных процессоров. Может вызывать вылеты, но значительно увеличивает кадровую частоту;

source: **shader detail**: *low*, *medium*, *high* or *very high* -- set the quality of shader effects;
ru: **шейдерные эффекты** -- *низкие*, *средние*, *высокие* и *очень высокие*. Управляет качеством эффектов, реализуемых с помощью шейдеров;

source: **effect detail**: *low*, *medium*, or *high* -- set normal effects quality;
ru: **детальность эффектов** -- *низкая*, *средняя* и *высокая*. Задаёт качество эффектов, для отрисовки которых используются ресурсы центрального процессора;

source: **paged memory pool** -- *low*, *medium*, *high* - set the maximum size of the game memory pool;
ru: **доступный пул памяти** -- *низкий*, *средний* или *высокий*. Задаёт объём памяти, который сможет адресовать игра. При достаточном объёме установленной оперативной памяти всегда выбирайте высокий;

source: **model and texture detail**: *low*, *medium* or *high*. The higher the level, the more powerful GPU will be required.
ru: **качество моделей и текстур** -- *низкая*, *средняя* и *высокая*. Задаёт качество отрисовки моделей и текстур и их детальность.

source: Game launch options
ru: Параметры запуска игры

source: **Game launch options** allow the user to override game launch options. This feature is available for advanced users only. Most users should not use it.
ru: Строка **Параметры запуска** позволяет указать параметры инициализации управляемой игры. Эта строка предназначена лишь для опытных пользователей. Если вы не знаете для чего она нужна и что сюда вводить -- не вводите ничего и оставьте строку пустой.

source: All parameters must be separated by spaces.
ru: Параметры нужно вводить в одну строку через один пробел.

source: Example:
ru: Пример:

source: Warning! Do not use the ``-dxlevel`` command line option as this will cause the game video settings to no longer be saved correctly. This is a known common issue of all Source Engine games.
ru: Внимание! Не используйте параметр запуска **-dxlevel**, т.к. это приведёт к тому, что настройки игры перестанут корректно сохраняться. Это известный баг всех игр на движке Source.

source: Changing game launch options
ru: Изменение параметров запуска игры

source: Start the Steam client -- select the game from the Steam Library -- press right mouse button -- select **Properties** -- press the **Set launch options** button -- set new launch options -- press **OK** and **Close** -- launch the game.
ru: Запустите Steam, выберите в списке нужную игру, нажмите по ней правой кнопкой мыши -- выберите **Свойства** -- нажмите кнопку **Параметры запуска** и укажите нужные вам параметры запуска, затем нажмите **OK** и запустите игру.

source: List of supported launch options
ru: Поддерживаемые параметры запуска игр

source: Available launch options:
ru: Следующие параметры запуска поддерживаются большинством игр на движке Source:

source: **-novid** (**-novideo**) -- disable game intro video;
ru: **-novid** (**-novideo**) -- отключает видеоролик, проигрываемый при запуске игры;

source: **-autoconfig** -- restore default settings. The game will ignore all settings and installed :ref:`FPS-configs <fps-about>`;
ru: **-autoconfig** -- восстанавливает настройки графики по умолчанию. Игнорирует любые установленные настройки и :ref:`FPS-конфиги <fps-about>` до удаления данного параметра;

source: **-full** (**-fullscreen**) -- start the game in fullscreen mode;
ru: **-full** (**-fullscreen**) -- запускать игру в полноэкранном режиме;

source: **-window** (**-sw** или **-windowed**) -- start the game in windowed mode;
ru: **-window** (**-sw** или **-windowed**) -- запускать игру в оконном режиме;

source: **-width** или **-w** -- set horizontal resolution or window size;
ru: **-width** или **-w** -- указать разрешение или ширину окна по горизонтали;

source: **-height** или **-h** -- set vertical resolution or window size;
ru: **-height** или **-h** -- указать разрешение или высоту окна по вертикали;

source: **-console** -- enable and automatically launch the developer console;
ru: **-console** -- включает и автоматически запускает консоль разработчика;

source: **-textmode** -- start the game in the text mode;
ru: **-textmode** -- запускать игру в текстовом режиме;

source: **-dxlevel** -- enforce DirectX level (available values are *80*, *81*, *90*, *95*). Do not use it due to :ref:`known major issues <gt-params>`. Use :ref:`graphic tweaker <gt-type1>` instead;
ru: **-dxlevel** -- устанавливает режим DirectX (допустимые значения -- *80*, *81*, *90*, *95*). Категорически не рекомендуется к использованию (подробности :ref:`здесь <gt-params>`). Вместо него лучше использовать выбор режима DirectX в одноимённом поле :ref:`графического твикера <gt-type1>`;

source: **-heapsize X** -- set heap size. Can be calculated using the following formula: (RAM / 2 * 1024). Examples for popular RAM sizes:
ru: **-heapsize ЧИСЛО** -- устанавливает объём занимаемой памяти. Рассчитывается по формуле: (оперативная память / 2 * 1024). Примеры чисел для популярных размеров ОП:

source: 512 MB -> **262144**;
ru: 512 МБ -> **262144**;

source: 1 GB -> **524288**;
ru: 1 ГБ -> **524288**;

source: 2 GB -> **1048576**;
ru: 2 ГБ -> **1048576**;

source: 3 GB -> **1572864**;
ru: 3 ГБ -> **1572864**;

source: 4 GB -> **2097152**;
ru: 4 ГБ -> **2097152**;

source: **-nojoy** -- disable gamepads initialization;
ru: **-nojoy** -- отключает инициализацию геймпадов в игре;

source: **-noipx** -- disable IPX connections support;
ru: **-noipx** -- не загружает IPX соединений, позволяет сэкономить оперативную память;

source: **-noborder** -- disable window border and controls in windowed mode;
ru: **-noborder** -- не отображать рамку и заголовок окна при запуске игры в оконном режиме;

source: **-noforcemspd** -- use mouse speed settings from Windows;
ru: **-noforcemspd** -- использовать настройки скорости мыши из Windows;

source: **-noforcemparms** -- use mouse buttons settings from Windows;
ru: **-noforcemparms** -- использовать настройки кнопок мыши из Windows;

source: **-noforcemaccel** -- use mouse acceleration settings from Windows;
ru: **-noforcemaccel** -- использовать настройки ускорения мыши из Windows;

source: **-freq X** (**-refresh X**) -- set the monitor refresh rate for fullscreen mode;
ru: **-freq ЧИСЛО** (**-refresh ЧИСЛО**) -- устанавливает частоту регенерации монитора;

source: **-nocrashdialog** -- disable built-in debugger. Will disable crash reports;
ru: **-nocrashdialog** -- запрещает встроенный в игру отладчик, позволяет сэкономить немного оперативной памяти;

source: **-32bit** -- start the game in legacy 32-bit mode when running on a 64-bit operating system (x64);
ru: **-32bit** -- запускает игру в 32-битном режиме на 64-битной операционной системе (x64);

source: **-dev** -- enable developer mode: game debug messages will be displayed directly on the HUD;
ru: **-dev** -- включает режим разработчика: последние строки консоли будут отображаться поверх HUD игры;

source: **-condebug** -- write the contents of the developer console to the ``console.log`` file;
ru: **-condebug** -- включает режим отладки, при котором всё содержимое консоли будет сохраняться в файл ``console.log``;

source: **-toconsole** -- force console mode even if the ``+map`` parameter is used;
ru: **-toconsole** -- принудительно запускает консоль, даже есть указан параметр ``+map``, заставляющий движок загрузить карту при запуске игры;

source: **-lv** -- enable Low Violence mode in Left 4 Dead (2);
ru: **-lv** -- включает режим Low Violence в Left 4 Dead (2);

source: **-sillygibs** -- enable Low Violence mode in Team Fortress 2.
ru: **-sillygibs** -- включает режим Low Violence в Team Fortress 2.

source: Video profiles: maximum quality
ru: Профиль настроек: максимальное качество

source: The **Maximum quality** button will set all graphic settings to recommended maximum:
ru: Кнопка **Максимальное качество** устанавливает все графические настройки на рекомендуемый максимум:

source: **display mode** -> fullscreen;
ru: **режим запуска** -> полноэкранный;

source: **model quality** -> high;
ru: **детализация моделей** -> высокая;

source: **texture quality** -> high;
ru: **детализация текстур** -> высокая;

source: **shader quality** -> high;
ru: **шейдеры** -> высоко;

source: **water reflections** -> reflect world;
ru: **отражения в воде** -> отражать мир;

source: **shadow quality** -> high;
ru: **прорисовка теней** -> высокая;

source: **color correction** -> enabled;
ru: **коррекция цвета** -> включена;

source: **antialiasing** -> disabled;
ru: **сглаживание** -> нет (отключено);

source: **filtering** -> anisotropic 4x;
ru: **фильтрация** -> Анизотропная 4x;

source: **vertical synchronization** -> disabled;
ru: **вертикальная синхронизация** -> выключена;

source: **motion blur** -> disabled;
ru: **размытие движения** -> выключено;

source: **DirectX mode** -> 9.0c;
ru: **режим DirectX** -> 9.0c;

source: **High Dynamic Range** -> full.
ru: **HDR** -> полные.

source: Video profiles: maximum performance
ru: Профиль настроек: максимальная производительность

source: The **Maximum performance** button will set all graphic settings to recommended minimum:
ru: Кнопка **Максимальная производительность**, наоборот, устанавливает все графические настройки на рекомендуемый минимум:

source: **model quality** -> low;
ru: **детализация моделей** -> низкая;

source: **texture quality** -> low;
ru: **детализация текстур** -> низкая;

source: **shader quality** -> low;
ru: **шейдеры** -> низко;

source: **water reflections** -> simple;
ru: **отражения в воде** -> простые;

source: **shadow quality** -> low;
ru: **прорисовка теней** -> низкая;

source: **color correction** -> disabled;
ru: **коррекция цвета** -> выключена;

source: **filtering** -> trilinear;
ru: **фильтрация** -> трилинейная;

source: **DirectX mode** -> will ask user to enable 8.0;
ru: **режим DirectX** -> запрос на включение 8.0;

source: **High Dynamic Range** -> disabled.
ru: **HDR** -> выключены.

source: If you want to reach maximum performance, you should install a special :ref:`FPS-config <fps-configs>`.
ru: Чтобы ещё больше снизить качество изображения и получить наибольшее число кадров в секунду, вы можете установить особый :ref:`FPS-конфиг <fps-configs>`.

source: Other useful information about profiles
ru: Прочая полезная информация о профилях настроек

source: **Maximum quality** and **Maximum performance** will not automatically save video settings. You should check and save them manually by clicking the **Save settings** button.
ru: Кнопки **Максимальное качество** и **Максимальная производительность** автоматически не сохраняют внесённые изменения, а дают вам возможность подкорректировать что-либо. Чтобы сохранить настройки, нажмите кнопку **Сохранить**.

source: If safe clean is enabled (green light in the status bar), the backup will be created automatically. You can restore or delete it on :ref:`BackUps <backups-about>` tab.
ru: Если включена опция безопасной очистки (в статусной строке программы горит зелёный индикатор), то будет автоматически создана резервная копия, которую вы сможете восстановить или удалить на странице :ref:`Резервные копии <backups-about>`.
