Repository: SeanSpawn/SrcRepair
Catalog: docs/source/locale/*/LC_MESSAGES/hud-manager.po
Languages: ru

source: HUD manager
ru: Управление пользовательскими HUD

source: About HUD manager
ru: О менеджере HUD

source: On this page you can install, update or remove one of the available and tested HUDs into the selected game.
ru: На этой странице вы можете установить, удалить или обновить один из доступных и протестированных HUD в выбранную игру.

source: Each HUD has a readme file and a screenshot. Select one from the list and you will be able to see it.
ru: Для каждого HUD доступно небольшое описание и скриншот. Выберите HUD из списка и сможете увидеть его.

source: All HUDs are being downloaded from the cloud and licensed "as is". Additional licensing information can be found on their home pages.
ru: Все файлы HUD загружаются из облака и распространяются по лицензии "как есть". Дополнительная информация о лицензировании может быть найдена на домашних страницах этих HUD.

source: This module will be unavailable if the current game does not support custom HUDs.
ru: Этот модуль будет недоступен если выбранная игра не поддерживает установку нестандартных HUD.

source: HUD installation
ru: Установка HUD

source: To install a HUD, select it from the list of available HUDs, click the **Install selected HUD** button and confirm this operation.
ru: Чтобы установить HUD, выберите его из списка, а затем нажмите кнопку **Установить выбранный HUD** и подтвердите намерение.

source: All required files will be downloaded and installed automatically.
ru: Все необходимые для работы файлы будут загружены и установлены автоматически.

source: Do not install more than one HUD, as this may lead to unpredictable consequences.
ru: Не устанавливайте более одного HUD в игру, т.к. это может привести к непредсказуемым последствиям.

source: HUD uninstallation
ru: Удаление HUD

source: To remove a HUD, select it from the list of available HUDs, click the **Remove selected HUD** button and confirm this operation.
ru: Чтобы удалить HUD, выберите его из списка и нажмите кнопку **Удалить выбранный HUD**, после чего подтвердите намерение.

source: This action is only available for installed HUDs.
ru: Данное действие доступно только для уже установленных HUD.

source: Updating installed HUD
ru: Обновление или переустановка HUD

source: To update or reinstall an installed HUD, select it from the list of available HUDs, click the **Update selected HUD** button and confirm this operation.
ru: В любой момент вы можете переустановить, либо обновить до новейшей доступной версии любой установленный HUD. Для этого просто выберите его из списка и нажмите кнопку **Обновить выбранный HUD**.

source: Warning! All custom changes to the installed HUD will be permanently lost.
ru: Внимание! Если вы производили какие-то изменения в файлах установленного HUD, все они будут потеряны.

source: Additional HUD manager buttons
ru: Прочие элементы управления

source: Additional buttons:
ru: Наряду с уже описанными кнопками, существуют ещё две:

source: button with house -- open HUD homepage in a default Web browser;
ru: кнопка с домом -- переход на домашнюю страницу HUD в используемом по умолчанию веб-обозревателе;

source: button with magnifying glass -- show installed HUD files in a default file manager.
ru: кнопка с лупой -- показать файлы установленного HUD в файловом менеджере по умолчанию (в Microsoft Windows -- в Проводнике).
