Repository: SeanSpawn/SrcRepair
Catalog: docs/source/locale/*/LC_MESSAGES/privacy.po
Languages: ru

source: Privacy policy
ru: Политика конфиденциальности

source: Version
ru: Версия

source: Last update: **2024-07-01**.
ru: Дата последнего обновления: **01.07.2024**.

source: Application
ru: Приложение

source: The application itself doesn't use any telemetry or data collection features.
ru: Данное приложение не содержит функций по сбору телеметрии и любых персональных данных.

source: Update checker
ru: Проверка обновлений

source: The update checker module sends the following data to the update web server to obtain information about the availability of new versions, as well as links to download them:
ru: Модуль проверки обновлений отправляет на веб-сервер обновлений следующие данные для получения информации о наличии новых версий, а также ссылок для их скачивания:

source: IP-address;
ru: IP-адрес;

source: HTTP_USER_AGENT in a special format, including:
ru: HTTP_USER_AGENT в особом формате:

source: OS name;
ru: название операционной системы;

source: OS version;
ru: версия операционной системы;

source: OS architecture;
ru: архитектура операционной системы;

source: application name;
ru: название приложения;

source: application version;
ru: версия приложения;

source: application language.
ru: язык приложения.

source: This information may be stored in the web server's access.log file for up to 4 weeks before it is permanently deleted.
ru: Эти сведения могут храниться в журнале access.log веб-сервера в течение 4 недель до того, как они будут безвозвратно удалены.

source: If you don't want to share it, you can turn off automatic checking for updates in :ref:`Advanced settings <settings-advanced>` and not use this feature.
ru: Если вы не хотите делиться указанными выше данными, то можете отключить средство автоматической проверки обновлений в :ref:`расширенных настройках <settings-advanced>` и не использовать данную функцию.

source: Report builder
ru: Создание отчётов для Техподдержки

source: The Report builder module, with an explicit consent of the user, collects important for troubleshooting :ref:`system information <modules-reporter>` and stores it locally in a Zip archive.
ru: Модуль создания отчётов для Техподдержки, после получения явного согласия пользователя, собирает важную для разрешения проблем :ref:`системную информацию <modules-reporter>` и сохраняет её локально в Zip-архив.

source: This information is not shared with anyone.
ru: Эта информация никому не передаётся.
