Repository: SeanSpawn/SrcRepair
Catalog: docs/help/source/locale/*/LC_MESSAGES/fps-configs.po
Languages: ru

source: FPS-config manager
ru: Управление FPS-конфигами

source: About FPS configs
ru: О FPS-конфигах

source: On this page you can install one of available and tested FPS-configs into selected game. FPS-config is a text file with ``autoexec.cfg`` name. It can significantly increase game performance by changing hidden extended video settings.
ru: На этой странице вы можете быстро установить один из доступных и протестированных нами FPS-конфигов в выбранную игру. Конфиг (файл конфигурации) представляет собой текстовый файл с именем ``autoexec.cfg``, который способен значительно увеличить производительность игры со значительной потерей качества выдаваемой картинки.

source: Settings, obtained from FPS-config, have higher priority than set by :ref:`Graphic tweaker <graphic-tweaker>` or by the game itself. Select config from list to read it's description.
ru: Если вы используете FPS-конфиг, то настройки, находящиеся на вкладке :ref:`Графические настройки <graphic-tweaker>` не будут влиять на игру, т.к. опции, полученные из конфига, имеют более высокий приоритет.

source: Installed FPS-configs can be edited with :ref:`Config editor <editor-working>`.
ru: Установленные FPS-конфиги могут быть загружены в :ref:`Редактор конфигов <editor-working>`.

source: All FPS-configs are being downloaded from our cloud and licensed "as is".
ru: Все FPS-конфиги загружаются из облака и распространяются по лицензии "как есть".

source: Supported FPS-configs
ru: Поддерживаемые FPS-конфиги

source: The following FPS-configs are supported by current version of application:
ru: Следующие FPS-конфиги поддерживаются в текущей версии программы:

source: chrismaxquality (reverse);
ru: chrismaxquality (обратный);

source: comangliacinema (reverse);
ru: comangliacinema (обратный);

source: mastercomfig-quality (reverse);
ru: mastercomfig-quality (обратный);

source: FPS-config installation
ru: Установка FPS-конфига

source: To install FPS-config, select it from the list of available configs, press **Install selected config** button and confirm this operation.
ru: Чтобы установить конфиг, выберите один из предустановленных конфигов, доступных для этой игры, нажмите на кнопку **Установить выбранный конфиг** и ответьте утвердительно на вопрос.

source: If safe clean is enabled (green light in status bar) and you already has installed ``autoexec.cfg`` file, backup will be created automatically. You can restore or delete it on :ref:`BackUps <backups-about>` tab.
ru: Если включена опция безопасной очистки (в статусной строке программы горит зелёный индикатор), то при наличии уже существующего файла ``autoexec.cfg``, будет автоматически создана его резервная копия, которую вы сможете восстановить в любое время на странице :ref:`Резервные копии <backups-about>`.

source: Some configs are not supported by games. You will see warning message if so.
ru: Внимание! Далеко не все конфиги поддерживаются управляемой игрой. Если вы выбрали неподдерживаемый конфиг, будет выведено соответствующее сообщение.

source: Do not install multiple FPS-configs to game. It will cause unpredictable consequences.
ru: Не устанавливайте несколько FPS-конфигов одновременно, т.к. это может привести к непредсказуемым последствиям.

source: FPS-config uninstallation
ru: Удаление FPS-конфига

source: To remove FPS-config, select it from the list of available configs, press **Remove selected config** (or **Remove installed config**) button and confirm this operation.
ru: Чтобы удалить имеющийся конфиг, нажмите на кнопку **Удалить установленный конфиг** (или **Удалить имеющийся конфиг**).

source: If safe clean is enabled (green light in status bar), backup will be created automatically. You can restore or delete it on :ref:`BackUps <backups-about>` tab.
ru: Если включена опция безопасной очистки (в статусной строке программы горит зелёный индикатор), то будет автоматически создана резервная копия, которую вы сможете восстановить в любое время на странице :ref:`Резервные копии <backups-about>`.

source: Known issues with FPS-configs
ru: Возможные проблемы с FPS-конфигами

source: After installing FPS-configs voice chat can stop working, sprays and face animation can be disabled. This is conceived. Most of FPS-configs disable this functions in order to significantly increase game performance.
ru: После установки FPS-конфига у вас могут перестать отображаться спреи в игре, прекрат работу лицевая анимация, либо вы перестанете слышать речь других людей в голосовом чате. Это нормально, т.к. большинство FPS конфигов отключают данные функции в угоду повышения производительности.

source: If you want to enable them again, you will need to :ref:`remove all installed FPS-configs <fps-uninstall>` and then change the following variables via ``autoexec.cfg`` file or by using developer console:
ru: Если вы снова хотите включить данные функции, полностью :ref:`удалите FPS-конфиги <fps-uninstall>`, а затем пропишите в консоли разработчика игры или в файле **autoexec.cfg** следующие строки:

source: If you use developer console (can be called by pressing **~** (tilde) button), don't forget to press **Enter** after entering each row.
ru: Если вы прописываете строки в консоли разработчика (вызывается клавишей **~** (тильда)), не забывайте после каждой нажимать **Enter** на клавиатуре.

source: Reverse FPS-configs
ru: FPS-конфиги наоборот

source: If you want to set all video settings to maxium to get best quality, you can install specical :ref:`reverse FPS-configs <fps-available>`.
ru: Если вы хотите установить все настройки игры на максимум, установите один из специальных :ref:`FPS-конфигов <fps-available>`, отмеченных словом **обратный**.

source: You will need a high-end computer in order to use them.
ru: Это обеспечит наилучшее качество графики, но потребуется производительный компьютер.
